---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarElemHookStartType
source: html/41147855-633a-ca92-93c8-c7c0860f2cce.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarElemHookStartType Property

"Hook At Start"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarElemHookStartType { get; }
```